[HackRewardBuffEnemy X2AbilityTemplate]
LocFriendlyName="Electric Feedback"
LocLongDescription="Target receives +<Ability:SUPERCHARGE_AIM_BONUS/> Aim, +<Ability:SUPERCHARGE_DEFENSE_BONUS> Defense, and +<Ability:SUPERCHARGE_HACK_DEFENSE_CHANGE/> Hack Defense as result of a failed hack."

[BuffEnemy X2HackRewardTemplate]
FriendlyName="Supercharge"
Description="A failed hack will increase this target's Aim, Defense, and Hack Defense at the cost of a soft reboot (stun)."

[ShutdownRobot X2HackRewardTemplate]
FriendlyName="Shutdown Enemy"
Description="Force a hard reboot of the target (stun)."

[ControlRobot X2HackRewardTemplate]
FriendlyName="Control Enemy"
Description="Take temporary control of this unit."

[ShutdownTurret X2HackRewardTemplate]
FriendlyName="Control Turret"
Description="Take temporary control of this automated turret."

[ControlTurret X2HackRewardTemplate]
FriendlyName="Improved Turret Control"
Description="Take temporary control of this automated turret."
